# -*- coding: utf-8 -*-
from .develop import FireFox, PhantomJS

__author__ = 'whoami'
__date__ = '19.02.16 23:16'
__description__ = """
Модуль описывающий критические настройки. Не стоит тут ничего трогать,
если вы не знаете что делаете.
"""

# Выбор вебдрайвера для парсинга, доступны FireFox и PhantomJS.
web_driver = FireFox

# Нужно ли создавать виртуальный дисплей?
use_virtual_display = False

# =================== Параметры PhantomJS. ===================================
# Параметры запуска для phantomjs,
# чтобы знать доступные параметры в консоле phantomjs --help.
# Не нужно добавлять ключи --proxy и --proxy_type они подставляются сами!
# Пример:
# ['--ignore-ssl-errors=true', '--ssl-protocol=tlsv1']
service_args = None
# ============================================================================

# =================== Параметры IMAP. ========================================
# Сервер
imap_server = 'imap-mail.outlook.com'

# Порт для imap
imap_port = '993'
# ============================================================================

# Регулярное выражение для поиска ссылок на подтверждение аккаунта
reg_exp_link_to_confirm = rb'\"(http\:\/\/www\.match\.com.+?land\=.+?)\"'

# Тип прокси.
proxy_type = 'socks5'

# Режим отладки
debug = False
