# -*- coding: utf-8 -*-

__author__ = 'whoami'
__date__ = '19.02.16 23:16'
__description__ = """
Тут описаны базовые настройки.
"""

# Количество подмигиваний.
winks_cnt = 40

# Ожидание выгрузки изображения.
image_load_waits = 60

# Количество потоков. Только для подмигиваний!
thread_count = 2

# Страница для тестирования прокси.
# test_url = 'https://whoer.net/'

# Сервер для скриншотов
from .api_conf import main_url
screen_url = main_url[0:main_url.rindex(':')]

# ======================= Параметры брузера ==================================
# Ожидание полной загрузки страницы.
load_timeout = 120

# Явное ожидание появления элемента на странице.
implicitly_wait = 5

# Неявное ожидание появления элемента на странице.
explicit_waits = 15

# Ширина окна. Выбирается рандомное значение.
br_width = [550, 768, 1080, 1024, 768, 900, 800, 900, 720]

# Длинна окна. Выбирается рандомное значение.
br_heigth = [1150, 1366, 1920, 1280, 1024, 1600, 1280, 1440, 1280]
# ============================================================================

# ======================== Логгирование ======================================
# Папка для логов.
log_path = 'logs'

# Папка для скриншотов
screen_dir = 'screen'
# ============================================================================
# тестовая страница
test_url = 'https://whoer.net/ru'